<?php

// PHPでの psfenw (PackedSfenWeb-base64url) デコーダ実装例
// TypeScriptでのエンコーダ/デコーダ実装例は src/modules/psfenw.ts

/*

# packedsfen-web

- 256bit(32bytes)バイナリ列 or URL-safe文字列43bytes での将棋局面表現を想定した仕様案
  - URL-safe文字列エンコードはbase64url(padding無し)を用いる
- +着手の表現は +26bit(282bit,47文字)
- +手数の表現は
  - 0-31手:+6bit(288bit,48文字)
  - 32-1023手:+12bit(294bit,49文字)
  - 1024手-32767手:+18bit(300bit,50文字)
  - 32768手-1048575手:+24bit(306bit,51文字)
- Web局面図など、Web上での局面図交換用途を想定
- 部分図・詰将棋・駒落の局面の表現を考慮するため、やねうら王のバイナリ教師データ等で使われているpackedsfenとは非互換

- 参考
  - [やねうら王ブログ - 将棋の局面を256bitに圧縮するには？ - 2016年7月2日](http://yaneuraou.yaneu.com/2016/07/02/%E5%B0%86%E6%A3%8B%E3%81%AE%E5%B1%80%E9%9D%A2%E3%82%92256bit%E3%81%AB%E5%9C%A7%E7%B8%AE%E3%81%99%E3%82%8B%E3%81%AB%E3%81%AF%EF%BC%9F/)
  - [github - yaneurao/YaneuraOu - source/extra/sfen_packer.cpp](https://github.com/yaneurao/YaneuraOu/blob/master/source/extra/sfen_packer.cpp)

## bit格納順

- 上位bit(MSB)から順に格納していく実装を採用
  - おそらく大差は無いが、固定ハフマン符号部のデコード処理が若干容易？
  - bitset, bitstream 等のライブラリでは下位bit(LSB)から格納していく場合が多そう?
  - ヘッダや拡張ビットは下位bit(LSB)から順に格納し、ハフマン符号部は上位bit(MSB)から順に格納していく圧縮方式も存在する 例: Deflate
    - [Mr.Kの資料室 - メモ・RFC1951伸長コード](http://mrkk.ciao.jp/dx11/rfc1951decode.html)
    - [futomi's CGI Cafe - RFC 1951 DEFLATE Compressed Data Format Specification version 1.3 日本語訳 - 3.1 全体的な規約](https://www.futomi.com/lecture/japanese/rfc1951.html#s3_1)
  - BASE64が以下のような区切りでバイナリデータ列からの変換を行う（MSBから順に近い）のに合わせたいという事情もある
    - 1byte目の上位6bit
    - 1byte目の下位2bit + 2byte目の上位4bit
    - 2byte目の下位4bit + 3byte目の上位2bit
    - 3byte目の下位6bit
  - 数値をハフマン符号にエンコードする際、LSBから順に格納していくハフマン符号を採用すると、元の数値をbit逆順に格納するエンコードをする破目になりそうだった
    - いろいろ考えていたら「ハフマン符号は可変長の固定or浮動小数点数の一種」みたいな認識が生えてしまったので、やっぱりハフマン符号は上位bit(MSB)から格納するのが自然に思えた

- byte00 ⇒ byte31 の順
- 上位bit(MSB) ⇒ 下位bit(LSB) の順 (やねうら王ではbit順逆)

## データ格納順

- 基本(256bit)
  - 手番(1bit)
  - 先手玉の位置(6-7bit, 通常7bit)
  - 後手玉の位置(6-7bit, 通常7bit)
    - (やねうら王では7bit固定、双玉のみ)
  - 盤面（玉以外）
  - 先手持駒
  - 後手持駒
  - 駒落（玉以外）
    - (やねうら王では駒落の考慮なし)
- 最終着手(20bit, optional)
- 手数(6-24bit, optional)

## bitパターン

- 1列目: bitパターン(bit,2進)
  - `?`: パラメータにより変動するbit
  - `x`: bit長の範囲外
- 2列目: デコード想定値域(hex,16進)
- 3列目: bit長
- 4列目: 備考・注釈

## 手番

- `0xxxxxxx`, `0x00`-`0x7f`, 1bit, 先手/下手/黒番 sente/sitate/black
- `1xxxxxxx`, `0x80`-`0xff`, 1bit, 後手/上手/白番 gote/uwate/white

## 玉の位置 x 2

- 先手玉 ⇒ 後手玉 の順
- 詰将棋局面などで片玉・玉無しの場合、盤の表現に1bit余分に必要になるため、玉の位置から1bitずつケチる

- `00?????x`, `0x00`-`0x3f`, 7bit, pos00-pos31
- `01?????x`, `0x40`-`0x7f`, 7bit, pos32-pos63
- `10?????x`, `0x80`-`0xbf`, 7bit, pos64-pos95(pos81-pos95:unused)
- `11????xx`, `0xc0`-`0xff`, 6bit, sp00-sp15(sp00-sp14:unused)(sp15:玉無し)

例:

- `0000000x`, `0x00`-`0x01`, 7bit, pos00
- `0000001x`, `0x02`-`0x03`, 7bit, pos01
- `0000010x`, `0x04`-`0x05`, 7bit, pos02
- ...
- `0011111x`, `0x3e`-`0x3f`, 7bit, pos31
- `0100000x`, `0x40`-`0x41`, 7bit, pos32
- `0100001x`, `0x42`-`0x43`, 7bit, pos33
- ...
- `0111111x`, `0x7e`-`0x7f`, 7bit, pos63
- `1000000x`, `0x80`-`0x81`, 7bit, pos64
- `1000001x`, `0x82`-`0x83`, 7bit, pos65
- ...
- `1010000x`, `0xa0`-`0xa1`, 7bit, pos80
- `1010001x`, `0xa2`-`0xa3`, 7bit, pos81(unused)
- ...
- `1011111x`, `0xbe`-`0xbf`, 7bit, pos95(unused)
- `110000xx`, `0xc0`-`0xc3`, 6bit, sp00(unused)
- `110001xx`, `0xc4`-`0xc7`, 6bit, sp01(unused)
- ...
- `111111xx`, `0xfc`-`0xff`, 6bit, sp15(玉無し)

### 玉の位置 file/rank <=> pos

- 縦型座標
- pos00,1a,１一 ⇒ ... ⇒ pos08,1i,１九 ⇒ pos09,2a,２一 ⇒ ... ⇒ pos80,9i,９九

```
 9  8  7  6  5  4  3  2  1
72 63 54 45 36 27 18 09 00 a 一
73 64 55 46 37 28 19 10 01 b 二
74 65 56 47 38 29 20 11 02 c 三
75 66 57 48 39 30 21 12 03 d 四
76 67 58 49 40 31 22 13 04 e 五
77 68 59 50 41 32 23 14 05 f 六
78 69 60 51 42 33 24 15 06 g 七
79 70 61 52 43 34 25 16 07 h 八
80 71 62 53 44 35 26 17 08 i 九
```

## 盤上の駒の位置（玉以外） x 79(双玉) ~ 81(玉無し)

- pos00 ⇒ pos80 の順
- 玉が存在するマスは飛ばす
- 金将のみ、成を示すbitは無い

- `0xxxxxxx`, `0x00`-`0x7f`, 0bit, 空
- `10??xxxx`, `0x80`-`0xbf`, 4bit, 歩+成+手番
- `1100??xx`, `0xc0`-`0xcf`, 6bit, 香+成+手番
- `1101??xx`, `0xd0`-`0xdf`, 6bit, 桂+成+手番
- `1110??xx`, `0xe0`-`0xef`, 6bit, 銀+成+手番
- `11110?xx`, `0xf0`-`0xf7`, 6bit, 金+手番
- `111110??`, `0xf8`-`0xfb`, 8bit, 角+成+手番
- `111111??`, `0xfc`-`0xff`, 8bit, 飛+成+手番

### 成・手番の例

- `1000xxxx`, `0x80`-`0x8f`, 4bit, 歩兵+先手
- `1001xxxx`, `0x90`-`0x9f`, 4bit, 歩兵+後手
- `1010xxxx`, `0xa0`-`0xaf`, 4bit, と金+先手
- `1011xxxx`, `0xb0`-`0xbf`, 4bit, と金+後手

## 持駒/駒落 x 0 ~ 38

- 先手持駒 ⇒ 後手持駒 ⇒ 駒落 の順
- 飛車 ⇒ 角行 ⇒ 金将 ⇒ 銀将 ⇒ 桂馬 ⇒ 香車 ⇒ 歩兵 の順
  - 駒落の駒も順番は同様、金将はbit配列上は後手のものを用いるが歩兵の後に回す事はしない
- 駒落の手番は基本的に先手成駒のbit配列を使う
- 駒落の金のみ、後手成銀のbit配列を用いる
- 後手成銀以外の後手成駒のbit配列は使用しない

- `00?xxxxx`, `0x00`-`0x3f`, 3bit, 歩+手番
- `010xxxxx`, `0x40`-`0x5f`, 3bit, 駒落・歩(と金先手)
- `011xxxxx`, `0x60`-`0x7f`, 3bit, (unused)(と金後手)
- `1000?xxx`, `0x80`-`0x8f`, 5bit, 香+手番
- `10010xxx`, `0x90`-`0x97`, 5bit, 駒落・香(成香先手)
- `10011xxx`, `0x98`-`0x9f`, 5bit, (unused)(成香後手)
- `1010?xxx`, `0xa0`-`0xaf`, 5bit, 桂+手番
- `10110xxx`, `0xb0`-`0xb7`, 5bit, 駒落・桂(成桂先手)
- `10111xxx`, `0xb8`-`0xbf`, 5bit, (unused)(成桂後手)
- `1100?xxx`, `0xc0`-`0xcf`, 5bit, 銀+手番
- `11010xxx`, `0xd0`-`0xd7`, 5bit, 駒落・銀(成銀先手)
- `11011xxx`, `0xd8`-`0xdf`, 5bit, 駒落・金(成銀後手)
- `1110?xxx`, `0xe0`-`0xef`, 5bit, 金+手番
- `111100?x`, `0xf0`-`0xf3`, 7bit, 角+手番
- `1111010x`, `0xf4`-`0xf5`, 7bit, 駒落・角(竜馬先手)
- `1111011x`, `0xf6`-`0xf7`, 7bit, (unused)(竜馬後手)
- `111110?x`, `0xf8`-`0xfb`, 7bit, 飛+手番
- `1111110x`, `0xfc`-`0xfd`, 7bit, 駒落・飛(龍王先手)
- `1111111x`, `0xfe`-`0xff`, 7bit, (unused)(龍王後手)

## move

最終着手、若しくは次の指し手（候補手など）のいずれかを強調表示するのに用いる。

1bit turn
7bit movefrom pos / hand
7bit moveto pos / hand
1bit promotion
1bit same
1bit unused
4bit relative
4bit capture piecetype

move none: all zero

turn
0 black
1 white

move position
000 - 080 pos00-80
081 - 087 unused
088 - 095 komabako (OU,FU,KY,KE,GI,KI,KA,HI)
096 - 103 black hand (OU,FU,KY,KE,GI,KI,KA,HI)
104 - 111 unused
112 - 119 white hand (OU,FU,KY,KE,GI,KI,KA,HI)
120 - 127 unused

088 OU
089 FU
090 KY
091 KE
092 GI
093 KI
094 KA
095 HI
096 +OU
097 +FU
098 +KY
099 +KE
100 +GI
101 +KI
102 +KA
103 +HI
112 -OU
113 -FU
114 -KY
115 -KE
116 -GI
117 -KI
118 -KA
119 -HI

promotion
0 none
1 promotion

same
0 none
1 same

relative
00 none
01 L / 左
02 C / 直
03 R / 右
04 M / 寄
05 LM / 左寄
06 H / 打 (同位置に動かせる同種駒がある紛らわしい場合の駒打ちのみ)
07 RM / 右寄
08 U / 上
09 LU / 左上
10 CU / 直上 (本将棋では使わない)
11 RU / 右上
12 D / 引
13 LD / 左引
14 CD / 直引 (本将棋では使わない)
15 RD / 右引

capture piece type
00 none
01 FU
02 KY
03 KE
04 GI
05 KI
06 KA
07 HI
08 OU
09 TO
10 NY
11 NK
12 NG
13 unused
14 UM
15 RY

### special move

(実装未定)

```
abnormal
chudan
fuzumi
illegal_action
illegal_kachi
illegal_move
jishogi
kachi
max_moves
sennichite
time_up
toryo
tsumi
uchifuzume
oute_kaihimore
oute_sennichite
outori
```

## ply

```
bit pattern                 : range-min (hex pattern)     - range-max (hex pattern)
0?????                      :     0 (0x00)                -      31 (0x1f)
100000                      :   NaN (0x20)                -     NaN (0x20)
1????? 0?????               :    32 (0x21 0x00)           -    1023 (0x3f 0x1f)
1????? 1????? 0?????        :  1024 (0x21 0x20 0x00)      -   32767 (0x3f 0x3f 0x1f)
1????? 1????? 1????? 0????? : 32768 (0x21 0x20 0x20 0x00) - 1048575 (0x3f 0x3f 0x3f 0x1f)
```

## base64url

- [RFC 4648 §5: Base 64 Encoding with URL and Filename Safe Alphabet](https://tools.ietf.org/html/rfc4648#section-5)
- [(ja) wikipedia: Base64](https://ja.wikipedia.org/wiki/Base64)
- [(en) wikipedia: Base64](https://en.wikipedia.org/wiki/Base64)

index62 に `-`, index63 に `_` をそれぞれ使い、
padding文字 `=` は使用しない実装を予定。

### base64url index table (excerpt)

- Index(10), Binary(2), Char
- `00`, `000000`, `A`
- `01`, `000001`, `B`
- ...
- `25`, `011001`, `Z`
- `26`, `011010`, `a`
- `27`, `011011`, `b`
- ...
- `51`, `110011`, `z`
- `52`, `110100`, `0`
- `53`, `110101`, `1`
- ...
- `61`, `111101`, `9`
- `62`, `111110`, `-` ( standard base64では `+` )
- `63`, `111111`, `_` ( standard base64では `/` )

- `**`, `padding`, `=` ( optional )

## examples

- 平手 初期局面
  sfen: `lnsgkgsnl/1r5b1/ppppppppp/9/9/9/PPPPPPPPP/1B5R1/LNSGKGSNL b - 1`
  move: `none`
  psfenw-b64u: `LEmKRDDX5kR-acpEOPUiHiRD1Ih5ykQ41_ZEfGmKRDA`
- 電竜戦 第3回予行演習 2回戦☗ほっしーdolphinタッグ-☖Viper 終局図
  csa: https://golan.sakura.ne.jp/denryusen/dr1_test3/kifufiles/dr1t3t1+sg-2_hosshii_viper-300-2F+hosshii+viper+20200905203344.csa
  kifu: https://golan.sakura.ne.jp/denryusen/dr1_test3/dist/denryusen_single.html#dr1t3t1+sg-2_hosshii_viper-300-2F+hosshii+viper+20200905203344
  sfen: `1+B1k1G3/4PLL1K/+NGGSSSB+R+P/1NN+RN4/9/P3S4/1G1P5/9/L7L w 14P 1`
  move: `177☗８一角成`
  psfenw-b64u: `gVqgYH8Aw-APMOAEcaOA4_iA80B9PNDwNiDAAAAAAABJfwAlR`
- 電竜戦 第3回予行演習 10回戦☗Daig振り飛車-☖ほっしーdolphinタッグ 終局図
  csa: https://golan.sakura.ne.jp/denryusen/dr1_test3/kifufiles/dr1t3t1+sg-10_daigorilla_hosshii-300-2F+daigorilla+hosshii+20200906000224.csa
  kifu: https://golan.sakura.ne.jp/denryusen/dr1_test3/dist/denryusen_single.html#dr1t3t1+sg-10_daigorilla_hosshii-300-2F+daigorilla+hosshii+20200906000224
  sfen: `9/9/9/9/9/9/2k6/1r7/K8 b r2b4g4s4n4l18p 1`
  move: `346☖８八飛不成`
  psfenw-b64u: `UHgAAAAAAAAAAA_QB98-e973Oc5rWtYxjEkkkkkkkkm9jACqa`
- 電竜戦 第4回予行演習2部 23回戦☗Sylwi-☖ほっしー水匠タッグ 終局図
  csa: https://golan.sakura.ne.jp/denryusen/dr1_test4a/kifufiles/dr1t4+snc-23_sylwi_hosshii-300-2F+sylwi+hosshii+20201025090721.csa
  kifu: https://golan.sakura.ne.jp/denryusen/dr1_test4a/dist/denryusen_single.html#dr1t4+snc-23_sylwi_hosshii-300-2F+sylwi+hosshii+20201025090721
  sfen: `lr5nl/3sk1+S2/p2P1ps2/3Sp1p1p/PP1p1P1P1/1G4P1P/1K2P1N2/5G3/+bN1R4L w 2G2Pbnl2p 1`
  move: `115☗６三歩`
  psfenw-b64u: `xUuJKDDUQDrmUaBKDwSQOY4kfgA_RHjTFKB984B5rElhXgAjT`
- 電竜戦 第4回予行演習2部 25回戦☗ほっしー水匠タッグ-☖スーパーうさぴょん2X 208手目
  csa: https://golan.sakura.ne.jp/denryusen/dr1_test4a/kifufiles/dr1t4+snc-25_hosshii_superusa2x-300-2F+hosshii+superusa2x+20201025100533.csa
  kifu: https://golan.sakura.ne.jp/denryusen/dr1_test4a/dist/denryusen_single.html#dr1t4+snc-25_hosshii_superusa2x-300-2F+hosshii+superusa2x+20201025100533
  sfen: `5+RpG1/sp6K/ksn4G1/p1spp4/2p3+B1p/1GP+BP4/P4P3/3+n5/LN6L b RGSN2LP6p 1`
  move: `208☖８三銀左上`
  psfenw-b64u: `AZQkYePAJH0H8CASgCX03GvMwE8nho5khh85ikIAkkm3giQmQ`

*/

class Huffman {
  private array $data;
  private int $length;
  function __construct(int $num) {
    $this->data = array_fill(0, $num, 0);
    $this->length = 0;
  }
  public function add(int $v, int $l): void {
    $q = $this->length >> 3;
    $r = $this->length & 7;
    $x = (($v & [0x00, 0x80, 0xc0, 0xe0, 0xf0, 0xf8, 0xfc, 0xfe, 0xff][$l]) << 8) >> $r;
    $this->data[$q + 0] |= $x >> 8;
    $this->data[$q + 1] |= $x & 255;
    $this->length += $l;
  }
  public static function fromB64(string $b64) {
    $h = new Huffman(((strlen($b64)*6)>>3)+2);
    for ($i = 0; $i < strlen($b64); ++$i) {
      $v = strpos("ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_", substr($b64, $i, 1));
      if ($v !== FALSE) {
        $h->add($v << 2, 6);
      }
    }
    return $h;
  }
  public function toB64(): string {
    $r = "";
    for ($i = 0; $i < intdiv($this->length + 5, 6); ++$i) {
      $upper = $this->data[($i * 6) >> 3] << 8;
      $lower = $this->data[(($i * 6) >> 3) + 1];
      $v = (($upper | $lower) >> (10 - (($i * 6) & 7))) & 63;
      $r .= substr("ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789-_", $v, 1);
    }
    return $r;
  }
  public function getByteValue(int $i): int {
    $upper = $this->data[$i >> 3] << 8;
    $lower = $this->data[($i >> 3) + 1];
    return ((($upper | $lower) >> (8 - ($i & 7))) & 255);
  }
  public function getBitLength(): int {
    return $this->length;
  }
}

class Shogi {
  public int $color;
  public array $board;
  public array $hands;
  public int $tesuu;
  public array $move;
  function __construct() {
    $this->color = 0;
    $this->board = [
      array_fill(0, 9, NULL),
      array_fill(0, 9, NULL),
      array_fill(0, 9, NULL),
      array_fill(0, 9, NULL),
      array_fill(0, 9, NULL),
      array_fill(0, 9, NULL),
      array_fill(0, 9, NULL),
      array_fill(0, 9, NULL),
      array_fill(0, 9, NULL),
    ];
    $this->hands = [[
      "FU" => 0, "KY" => 0, "KE" => 0, "GI" => 0, "KI" => 0, "KA" => 0, "HI" => 0,
    ],[
      "FU" => 0, "KY" => 0, "KE" => 0, "GI" => 0, "KI" => 0, "KA" => 0, "HI" => 0,
    ]];
    $this->tesuu = 0;
    $this->move = [];
  }
  static function fromPsfenw(string $psfenw): Shogi {
    $h = Huffman::fromB64($psfenw);
    if ($h->getBitLength() < 256) {
      throw new Exception("input less than 256bit");
    }
    $bitpos = 0;
    $shogi = new Shogi();
    // 手番
    $dec = Shogi::tDeHufColor[$h->getByteValue($bitpos)];
    $shogi->color = $dec["j"];
    $bitpos += 1;
    // 玉位置
    for ($c = 0; $c < 2; ++$c) {
      $dec = Shogi::tDeHufKing[$h->getByteValue($bitpos)];
      if ($dec["j"] >= 0) {
        $shogi->board[$dec["f"]][$dec["r"]] = [ "color" => $c, "kind" => "OU" ];
      }
      $bitpos += $dec["l"];
    }
    // 盤上駒
    for ($f = 0; $f < 9; ++$f) {
      for ($r = 0; $r < 9; ++$r) {
        if (is_null($shogi->board[$f][$r])) {
          $dec = Shogi::tDeHufPiece[$h->getByteValue($bitpos)];
          if ($dec["c"] >= 0) {
            $shogi->board[$f][$r] = [ "color" => $dec["c"], "kind" => $dec["q"] ];
          }
          $bitpos += $dec["l"];
        }
      }
    }
    // 持駒・駒箱
    while ($bitpos < 256) {
      $dec = Shogi::tDeHufHand[$h->getByteValue($bitpos)];
      if ($dec["r"] === 0) {
        $shogi->hands[$dec["c"]][$dec["q"]] += 1;
      }
      $bitpos += $dec["l"];
    }
    if ($bitpos !== 256) {
      throw new Exception("psfenw base length is not 256bit");
    }
    if ($h->getBitLength() >= $bitpos + 26) {
      $m = [
        "color" => $h->getByteValue($bitpos) < 128 ? 0 : 1,
        "from" => NULL,
        "to" => NULL,
        "piece" => NULL,
        "promote" => (($h->getByteValue($bitpos + 8) & 1) === 1),
        "same" => (($h->getByteValue($bitpos + 9) & 1) === 1),
        "relative" => Shogi::tMoveRel[$h->getByteValue($bitpos + 14) & 15],
        "capture" => Shogi::tMoveCap[$h->getByteValue($bitpos + 18) & 15],
      ];
      $mFrom = $h->getByteValue($bitpos) & 127;
      $mTo = $h->getByteValue($bitpos + 7) & 127;
      if ($mFrom !== $mTo) {
        if ($mTo < 81) {
          $m["to"] = [ "f" => intdiv($mTo, 9), "r" => ($mTo % 9) ];
          $pTo = $shogi->board[intdiv($mTo, 9)][$mTo % 9];
          if (!is_null($pTo)) {
            $m["piece"] = $m["promote"] ? Shogi::tCsaUnpromoteKind[$pTo["kind"]] : $pTo["kind"];
          }
        } else {
          $m["piece"] = Shogi::tCsaKind[$mTo & 7];
        }
        if ($mFrom < 81) {
          $m["from"] = [ "f" => intdiv($mFrom, 9), "r" => ($mFrom % 9) ];
          $pFrom = $shogi->board[intdiv($mFrom, 9)][$mFrom % 9];
          if (!is_null($pFrom)) {
            $m["piece"] = $pFrom["kind"];
          }
        } else {
          $m["piece"] = Shogi::tCsaKind[$mFrom & 7];
        }
      }
      $shogi->move = $m;
      $bitpos += 26;
    }
    // 手数
    if ($h->getBitLength() >= $bitpos + 6 && ($h->getByteValue($bitpos) >> 2) !== 32) {
      $shogi->tesuu = 0;
      while ($h->getBitLength() >= $bitpos + 6) {
        $sByte = $h->getByteValue($bitpos);
        $shogi->tesuu += (($sByte & 124) >> 2);
        if ($sByte >= 128) {
          $shogi->tesuu = ($shogi->tesuu << 5);
        }
        $bitpos += 6;
      }
    }
    // 出力
    return $shogi;
  }
  function toSfen(int $tesuu = 1): string {
    $s = "";
    for ($r = 0; $r < 9; ++$r) {
      for ($f = 8; $f >= 0; --$f) {
        $nlen = 0;
        while ($f >= 0 && is_null($this->board[$f][$r])) {
          ++$nlen;
          --$f;
        }
        if ($nlen > 0) {
          $s .= $nlen;
        }
        if ($f >= 0) {
          $p = $this->board[$f][$r];
          $s .= Shogi::tCsa2SfenKind[$p["color"]][$p["kind"]];
        }
      }
      if ($r < 8) {
        $s .= "/";
      }
    }
    $s .= [" b ", " w "][$this->color];
    $h = "";
    for ($c = 0; $c < 2; ++$c) {
      for ($i = 7; $i > 0; --$i) {
        $kind = Shogi::tCsaKind[$i];
        $num = $this->hands[$c][$kind];
        if ($num > 1) {
          $h .= $num . Shogi::tCsa2SfenKind[$c][$kind];
        } elseif ($num === 1) {
          $h .= Shogi::tCsa2SfenKind[$c][$kind];
        }
      }
    }
    $s .= ($h === "") ? "-" : $h;
    $s .= " " . $tesuu;
    return $s;
  }
  function toMoveStr(): string {
    $m = $this->move;
    if (empty($m)) { return ""; }
    $s = "";
    $s .= $m["color"] === 0 ? "☗" : "☖";
    $s .= Shogi::tFileToKan[$m["to"]["f"]];
    $s .= Shogi::tRankToKan[$m["to"]["r"]];
    if ($m["same"]) {
      $s .= "同";
    }
    $s .= Shogi::tKindToKan[$m["piece"]];
    if (!is_null($m["relative"])) {
      $s .= Shogi::tRelToKan[$m["relative"]];
    }
    if ($m["promote"]) {
      $s .= "成";
    } else {
      if (!is_null($m["from"]) && $m["piece"] === Shogi::tCsaUnpromoteKind[$m["piece"]]) {
        if (
          $m["color"] === 0 && ($m["from"]["r"] < 3 || $m["to"]["r"] < 3) ||
          $m["color"] === 1 && ($m["from"]["r"] > 5 || $m["to"]["r"] > 5)
        ) {
          $s .= "不成";
        }
      }
    }
    return $s;
  }
  private const tDeHufColor = [
    [ "i" => 0, "j" => 0, "l" => 1 ],
    [ "i" => 1, "j" => 0, "l" => 1 ],
    [ "i" => 2, "j" => 0, "l" => 1 ],
    [ "i" => 3, "j" => 0, "l" => 1 ],
    [ "i" => 4, "j" => 0, "l" => 1 ],
    [ "i" => 5, "j" => 0, "l" => 1 ],
    [ "i" => 6, "j" => 0, "l" => 1 ],
    [ "i" => 7, "j" => 0, "l" => 1 ],
    [ "i" => 8, "j" => 0, "l" => 1 ],
    [ "i" => 9, "j" => 0, "l" => 1 ],
    [ "i" => 10, "j" => 0, "l" => 1 ],
    [ "i" => 11, "j" => 0, "l" => 1 ],
    [ "i" => 12, "j" => 0, "l" => 1 ],
    [ "i" => 13, "j" => 0, "l" => 1 ],
    [ "i" => 14, "j" => 0, "l" => 1 ],
    [ "i" => 15, "j" => 0, "l" => 1 ],
    [ "i" => 16, "j" => 0, "l" => 1 ],
    [ "i" => 17, "j" => 0, "l" => 1 ],
    [ "i" => 18, "j" => 0, "l" => 1 ],
    [ "i" => 19, "j" => 0, "l" => 1 ],
    [ "i" => 20, "j" => 0, "l" => 1 ],
    [ "i" => 21, "j" => 0, "l" => 1 ],
    [ "i" => 22, "j" => 0, "l" => 1 ],
    [ "i" => 23, "j" => 0, "l" => 1 ],
    [ "i" => 24, "j" => 0, "l" => 1 ],
    [ "i" => 25, "j" => 0, "l" => 1 ],
    [ "i" => 26, "j" => 0, "l" => 1 ],
    [ "i" => 27, "j" => 0, "l" => 1 ],
    [ "i" => 28, "j" => 0, "l" => 1 ],
    [ "i" => 29, "j" => 0, "l" => 1 ],
    [ "i" => 30, "j" => 0, "l" => 1 ],
    [ "i" => 31, "j" => 0, "l" => 1 ],
    [ "i" => 32, "j" => 0, "l" => 1 ],
    [ "i" => 33, "j" => 0, "l" => 1 ],
    [ "i" => 34, "j" => 0, "l" => 1 ],
    [ "i" => 35, "j" => 0, "l" => 1 ],
    [ "i" => 36, "j" => 0, "l" => 1 ],
    [ "i" => 37, "j" => 0, "l" => 1 ],
    [ "i" => 38, "j" => 0, "l" => 1 ],
    [ "i" => 39, "j" => 0, "l" => 1 ],
    [ "i" => 40, "j" => 0, "l" => 1 ],
    [ "i" => 41, "j" => 0, "l" => 1 ],
    [ "i" => 42, "j" => 0, "l" => 1 ],
    [ "i" => 43, "j" => 0, "l" => 1 ],
    [ "i" => 44, "j" => 0, "l" => 1 ],
    [ "i" => 45, "j" => 0, "l" => 1 ],
    [ "i" => 46, "j" => 0, "l" => 1 ],
    [ "i" => 47, "j" => 0, "l" => 1 ],
    [ "i" => 48, "j" => 0, "l" => 1 ],
    [ "i" => 49, "j" => 0, "l" => 1 ],
    [ "i" => 50, "j" => 0, "l" => 1 ],
    [ "i" => 51, "j" => 0, "l" => 1 ],
    [ "i" => 52, "j" => 0, "l" => 1 ],
    [ "i" => 53, "j" => 0, "l" => 1 ],
    [ "i" => 54, "j" => 0, "l" => 1 ],
    [ "i" => 55, "j" => 0, "l" => 1 ],
    [ "i" => 56, "j" => 0, "l" => 1 ],
    [ "i" => 57, "j" => 0, "l" => 1 ],
    [ "i" => 58, "j" => 0, "l" => 1 ],
    [ "i" => 59, "j" => 0, "l" => 1 ],
    [ "i" => 60, "j" => 0, "l" => 1 ],
    [ "i" => 61, "j" => 0, "l" => 1 ],
    [ "i" => 62, "j" => 0, "l" => 1 ],
    [ "i" => 63, "j" => 0, "l" => 1 ],
    [ "i" => 64, "j" => 0, "l" => 1 ],
    [ "i" => 65, "j" => 0, "l" => 1 ],
    [ "i" => 66, "j" => 0, "l" => 1 ],
    [ "i" => 67, "j" => 0, "l" => 1 ],
    [ "i" => 68, "j" => 0, "l" => 1 ],
    [ "i" => 69, "j" => 0, "l" => 1 ],
    [ "i" => 70, "j" => 0, "l" => 1 ],
    [ "i" => 71, "j" => 0, "l" => 1 ],
    [ "i" => 72, "j" => 0, "l" => 1 ],
    [ "i" => 73, "j" => 0, "l" => 1 ],
    [ "i" => 74, "j" => 0, "l" => 1 ],
    [ "i" => 75, "j" => 0, "l" => 1 ],
    [ "i" => 76, "j" => 0, "l" => 1 ],
    [ "i" => 77, "j" => 0, "l" => 1 ],
    [ "i" => 78, "j" => 0, "l" => 1 ],
    [ "i" => 79, "j" => 0, "l" => 1 ],
    [ "i" => 80, "j" => 0, "l" => 1 ],
    [ "i" => 81, "j" => 0, "l" => 1 ],
    [ "i" => 82, "j" => 0, "l" => 1 ],
    [ "i" => 83, "j" => 0, "l" => 1 ],
    [ "i" => 84, "j" => 0, "l" => 1 ],
    [ "i" => 85, "j" => 0, "l" => 1 ],
    [ "i" => 86, "j" => 0, "l" => 1 ],
    [ "i" => 87, "j" => 0, "l" => 1 ],
    [ "i" => 88, "j" => 0, "l" => 1 ],
    [ "i" => 89, "j" => 0, "l" => 1 ],
    [ "i" => 90, "j" => 0, "l" => 1 ],
    [ "i" => 91, "j" => 0, "l" => 1 ],
    [ "i" => 92, "j" => 0, "l" => 1 ],
    [ "i" => 93, "j" => 0, "l" => 1 ],
    [ "i" => 94, "j" => 0, "l" => 1 ],
    [ "i" => 95, "j" => 0, "l" => 1 ],
    [ "i" => 96, "j" => 0, "l" => 1 ],
    [ "i" => 97, "j" => 0, "l" => 1 ],
    [ "i" => 98, "j" => 0, "l" => 1 ],
    [ "i" => 99, "j" => 0, "l" => 1 ],
    [ "i" => 100, "j" => 0, "l" => 1 ],
    [ "i" => 101, "j" => 0, "l" => 1 ],
    [ "i" => 102, "j" => 0, "l" => 1 ],
    [ "i" => 103, "j" => 0, "l" => 1 ],
    [ "i" => 104, "j" => 0, "l" => 1 ],
    [ "i" => 105, "j" => 0, "l" => 1 ],
    [ "i" => 106, "j" => 0, "l" => 1 ],
    [ "i" => 107, "j" => 0, "l" => 1 ],
    [ "i" => 108, "j" => 0, "l" => 1 ],
    [ "i" => 109, "j" => 0, "l" => 1 ],
    [ "i" => 110, "j" => 0, "l" => 1 ],
    [ "i" => 111, "j" => 0, "l" => 1 ],
    [ "i" => 112, "j" => 0, "l" => 1 ],
    [ "i" => 113, "j" => 0, "l" => 1 ],
    [ "i" => 114, "j" => 0, "l" => 1 ],
    [ "i" => 115, "j" => 0, "l" => 1 ],
    [ "i" => 116, "j" => 0, "l" => 1 ],
    [ "i" => 117, "j" => 0, "l" => 1 ],
    [ "i" => 118, "j" => 0, "l" => 1 ],
    [ "i" => 119, "j" => 0, "l" => 1 ],
    [ "i" => 120, "j" => 0, "l" => 1 ],
    [ "i" => 121, "j" => 0, "l" => 1 ],
    [ "i" => 122, "j" => 0, "l" => 1 ],
    [ "i" => 123, "j" => 0, "l" => 1 ],
    [ "i" => 124, "j" => 0, "l" => 1 ],
    [ "i" => 125, "j" => 0, "l" => 1 ],
    [ "i" => 126, "j" => 0, "l" => 1 ],
    [ "i" => 127, "j" => 0, "l" => 1 ],
    [ "i" => 128, "j" => 1, "l" => 1 ],
    [ "i" => 129, "j" => 1, "l" => 1 ],
    [ "i" => 130, "j" => 1, "l" => 1 ],
    [ "i" => 131, "j" => 1, "l" => 1 ],
    [ "i" => 132, "j" => 1, "l" => 1 ],
    [ "i" => 133, "j" => 1, "l" => 1 ],
    [ "i" => 134, "j" => 1, "l" => 1 ],
    [ "i" => 135, "j" => 1, "l" => 1 ],
    [ "i" => 136, "j" => 1, "l" => 1 ],
    [ "i" => 137, "j" => 1, "l" => 1 ],
    [ "i" => 138, "j" => 1, "l" => 1 ],
    [ "i" => 139, "j" => 1, "l" => 1 ],
    [ "i" => 140, "j" => 1, "l" => 1 ],
    [ "i" => 141, "j" => 1, "l" => 1 ],
    [ "i" => 142, "j" => 1, "l" => 1 ],
    [ "i" => 143, "j" => 1, "l" => 1 ],
    [ "i" => 144, "j" => 1, "l" => 1 ],
    [ "i" => 145, "j" => 1, "l" => 1 ],
    [ "i" => 146, "j" => 1, "l" => 1 ],
    [ "i" => 147, "j" => 1, "l" => 1 ],
    [ "i" => 148, "j" => 1, "l" => 1 ],
    [ "i" => 149, "j" => 1, "l" => 1 ],
    [ "i" => 150, "j" => 1, "l" => 1 ],
    [ "i" => 151, "j" => 1, "l" => 1 ],
    [ "i" => 152, "j" => 1, "l" => 1 ],
    [ "i" => 153, "j" => 1, "l" => 1 ],
    [ "i" => 154, "j" => 1, "l" => 1 ],
    [ "i" => 155, "j" => 1, "l" => 1 ],
    [ "i" => 156, "j" => 1, "l" => 1 ],
    [ "i" => 157, "j" => 1, "l" => 1 ],
    [ "i" => 158, "j" => 1, "l" => 1 ],
    [ "i" => 159, "j" => 1, "l" => 1 ],
    [ "i" => 160, "j" => 1, "l" => 1 ],
    [ "i" => 161, "j" => 1, "l" => 1 ],
    [ "i" => 162, "j" => 1, "l" => 1 ],
    [ "i" => 163, "j" => 1, "l" => 1 ],
    [ "i" => 164, "j" => 1, "l" => 1 ],
    [ "i" => 165, "j" => 1, "l" => 1 ],
    [ "i" => 166, "j" => 1, "l" => 1 ],
    [ "i" => 167, "j" => 1, "l" => 1 ],
    [ "i" => 168, "j" => 1, "l" => 1 ],
    [ "i" => 169, "j" => 1, "l" => 1 ],
    [ "i" => 170, "j" => 1, "l" => 1 ],
    [ "i" => 171, "j" => 1, "l" => 1 ],
    [ "i" => 172, "j" => 1, "l" => 1 ],
    [ "i" => 173, "j" => 1, "l" => 1 ],
    [ "i" => 174, "j" => 1, "l" => 1 ],
    [ "i" => 175, "j" => 1, "l" => 1 ],
    [ "i" => 176, "j" => 1, "l" => 1 ],
    [ "i" => 177, "j" => 1, "l" => 1 ],
    [ "i" => 178, "j" => 1, "l" => 1 ],
    [ "i" => 179, "j" => 1, "l" => 1 ],
    [ "i" => 180, "j" => 1, "l" => 1 ],
    [ "i" => 181, "j" => 1, "l" => 1 ],
    [ "i" => 182, "j" => 1, "l" => 1 ],
    [ "i" => 183, "j" => 1, "l" => 1 ],
    [ "i" => 184, "j" => 1, "l" => 1 ],
    [ "i" => 185, "j" => 1, "l" => 1 ],
    [ "i" => 186, "j" => 1, "l" => 1 ],
    [ "i" => 187, "j" => 1, "l" => 1 ],
    [ "i" => 188, "j" => 1, "l" => 1 ],
    [ "i" => 189, "j" => 1, "l" => 1 ],
    [ "i" => 190, "j" => 1, "l" => 1 ],
    [ "i" => 191, "j" => 1, "l" => 1 ],
    [ "i" => 192, "j" => 1, "l" => 1 ],
    [ "i" => 193, "j" => 1, "l" => 1 ],
    [ "i" => 194, "j" => 1, "l" => 1 ],
    [ "i" => 195, "j" => 1, "l" => 1 ],
    [ "i" => 196, "j" => 1, "l" => 1 ],
    [ "i" => 197, "j" => 1, "l" => 1 ],
    [ "i" => 198, "j" => 1, "l" => 1 ],
    [ "i" => 199, "j" => 1, "l" => 1 ],
    [ "i" => 200, "j" => 1, "l" => 1 ],
    [ "i" => 201, "j" => 1, "l" => 1 ],
    [ "i" => 202, "j" => 1, "l" => 1 ],
    [ "i" => 203, "j" => 1, "l" => 1 ],
    [ "i" => 204, "j" => 1, "l" => 1 ],
    [ "i" => 205, "j" => 1, "l" => 1 ],
    [ "i" => 206, "j" => 1, "l" => 1 ],
    [ "i" => 207, "j" => 1, "l" => 1 ],
    [ "i" => 208, "j" => 1, "l" => 1 ],
    [ "i" => 209, "j" => 1, "l" => 1 ],
    [ "i" => 210, "j" => 1, "l" => 1 ],
    [ "i" => 211, "j" => 1, "l" => 1 ],
    [ "i" => 212, "j" => 1, "l" => 1 ],
    [ "i" => 213, "j" => 1, "l" => 1 ],
    [ "i" => 214, "j" => 1, "l" => 1 ],
    [ "i" => 215, "j" => 1, "l" => 1 ],
    [ "i" => 216, "j" => 1, "l" => 1 ],
    [ "i" => 217, "j" => 1, "l" => 1 ],
    [ "i" => 218, "j" => 1, "l" => 1 ],
    [ "i" => 219, "j" => 1, "l" => 1 ],
    [ "i" => 220, "j" => 1, "l" => 1 ],
    [ "i" => 221, "j" => 1, "l" => 1 ],
    [ "i" => 222, "j" => 1, "l" => 1 ],
    [ "i" => 223, "j" => 1, "l" => 1 ],
    [ "i" => 224, "j" => 1, "l" => 1 ],
    [ "i" => 225, "j" => 1, "l" => 1 ],
    [ "i" => 226, "j" => 1, "l" => 1 ],
    [ "i" => 227, "j" => 1, "l" => 1 ],
    [ "i" => 228, "j" => 1, "l" => 1 ],
    [ "i" => 229, "j" => 1, "l" => 1 ],
    [ "i" => 230, "j" => 1, "l" => 1 ],
    [ "i" => 231, "j" => 1, "l" => 1 ],
    [ "i" => 232, "j" => 1, "l" => 1 ],
    [ "i" => 233, "j" => 1, "l" => 1 ],
    [ "i" => 234, "j" => 1, "l" => 1 ],
    [ "i" => 235, "j" => 1, "l" => 1 ],
    [ "i" => 236, "j" => 1, "l" => 1 ],
    [ "i" => 237, "j" => 1, "l" => 1 ],
    [ "i" => 238, "j" => 1, "l" => 1 ],
    [ "i" => 239, "j" => 1, "l" => 1 ],
    [ "i" => 240, "j" => 1, "l" => 1 ],
    [ "i" => 241, "j" => 1, "l" => 1 ],
    [ "i" => 242, "j" => 1, "l" => 1 ],
    [ "i" => 243, "j" => 1, "l" => 1 ],
    [ "i" => 244, "j" => 1, "l" => 1 ],
    [ "i" => 245, "j" => 1, "l" => 1 ],
    [ "i" => 246, "j" => 1, "l" => 1 ],
    [ "i" => 247, "j" => 1, "l" => 1 ],
    [ "i" => 248, "j" => 1, "l" => 1 ],
    [ "i" => 249, "j" => 1, "l" => 1 ],
    [ "i" => 250, "j" => 1, "l" => 1 ],
    [ "i" => 251, "j" => 1, "l" => 1 ],
    [ "i" => 252, "j" => 1, "l" => 1 ],
    [ "i" => 253, "j" => 1, "l" => 1 ],
    [ "i" => 254, "j" => 1, "l" => 1 ],
    [ "i" => 255, "j" => 1, "l" => 1 ]
  ];
  private const tDeHufKing = [
    [ "i" => 0, "j" => 0, "f" => 0, "r" => 0, "l" => 7 ],
    [ "i" => 1, "j" => 0, "f" => 0, "r" => 0, "l" => 7 ],
    [ "i" => 2, "j" => 1, "f" => 0, "r" => 1, "l" => 7 ],
    [ "i" => 3, "j" => 1, "f" => 0, "r" => 1, "l" => 7 ],
    [ "i" => 4, "j" => 2, "f" => 0, "r" => 2, "l" => 7 ],
    [ "i" => 5, "j" => 2, "f" => 0, "r" => 2, "l" => 7 ],
    [ "i" => 6, "j" => 3, "f" => 0, "r" => 3, "l" => 7 ],
    [ "i" => 7, "j" => 3, "f" => 0, "r" => 3, "l" => 7 ],
    [ "i" => 8, "j" => 4, "f" => 0, "r" => 4, "l" => 7 ],
    [ "i" => 9, "j" => 4, "f" => 0, "r" => 4, "l" => 7 ],
    [ "i" => 10, "j" => 5, "f" => 0, "r" => 5, "l" => 7 ],
    [ "i" => 11, "j" => 5, "f" => 0, "r" => 5, "l" => 7 ],
    [ "i" => 12, "j" => 6, "f" => 0, "r" => 6, "l" => 7 ],
    [ "i" => 13, "j" => 6, "f" => 0, "r" => 6, "l" => 7 ],
    [ "i" => 14, "j" => 7, "f" => 0, "r" => 7, "l" => 7 ],
    [ "i" => 15, "j" => 7, "f" => 0, "r" => 7, "l" => 7 ],
    [ "i" => 16, "j" => 8, "f" => 0, "r" => 8, "l" => 7 ],
    [ "i" => 17, "j" => 8, "f" => 0, "r" => 8, "l" => 7 ],
    [ "i" => 18, "j" => 9, "f" => 1, "r" => 0, "l" => 7 ],
    [ "i" => 19, "j" => 9, "f" => 1, "r" => 0, "l" => 7 ],
    [ "i" => 20, "j" => 10, "f" => 1, "r" => 1, "l" => 7 ],
    [ "i" => 21, "j" => 10, "f" => 1, "r" => 1, "l" => 7 ],
    [ "i" => 22, "j" => 11, "f" => 1, "r" => 2, "l" => 7 ],
    [ "i" => 23, "j" => 11, "f" => 1, "r" => 2, "l" => 7 ],
    [ "i" => 24, "j" => 12, "f" => 1, "r" => 3, "l" => 7 ],
    [ "i" => 25, "j" => 12, "f" => 1, "r" => 3, "l" => 7 ],
    [ "i" => 26, "j" => 13, "f" => 1, "r" => 4, "l" => 7 ],
    [ "i" => 27, "j" => 13, "f" => 1, "r" => 4, "l" => 7 ],
    [ "i" => 28, "j" => 14, "f" => 1, "r" => 5, "l" => 7 ],
    [ "i" => 29, "j" => 14, "f" => 1, "r" => 5, "l" => 7 ],
    [ "i" => 30, "j" => 15, "f" => 1, "r" => 6, "l" => 7 ],
    [ "i" => 31, "j" => 15, "f" => 1, "r" => 6, "l" => 7 ],
    [ "i" => 32, "j" => 16, "f" => 1, "r" => 7, "l" => 7 ],
    [ "i" => 33, "j" => 16, "f" => 1, "r" => 7, "l" => 7 ],
    [ "i" => 34, "j" => 17, "f" => 1, "r" => 8, "l" => 7 ],
    [ "i" => 35, "j" => 17, "f" => 1, "r" => 8, "l" => 7 ],
    [ "i" => 36, "j" => 18, "f" => 2, "r" => 0, "l" => 7 ],
    [ "i" => 37, "j" => 18, "f" => 2, "r" => 0, "l" => 7 ],
    [ "i" => 38, "j" => 19, "f" => 2, "r" => 1, "l" => 7 ],
    [ "i" => 39, "j" => 19, "f" => 2, "r" => 1, "l" => 7 ],
    [ "i" => 40, "j" => 20, "f" => 2, "r" => 2, "l" => 7 ],
    [ "i" => 41, "j" => 20, "f" => 2, "r" => 2, "l" => 7 ],
    [ "i" => 42, "j" => 21, "f" => 2, "r" => 3, "l" => 7 ],
    [ "i" => 43, "j" => 21, "f" => 2, "r" => 3, "l" => 7 ],
    [ "i" => 44, "j" => 22, "f" => 2, "r" => 4, "l" => 7 ],
    [ "i" => 45, "j" => 22, "f" => 2, "r" => 4, "l" => 7 ],
    [ "i" => 46, "j" => 23, "f" => 2, "r" => 5, "l" => 7 ],
    [ "i" => 47, "j" => 23, "f" => 2, "r" => 5, "l" => 7 ],
    [ "i" => 48, "j" => 24, "f" => 2, "r" => 6, "l" => 7 ],
    [ "i" => 49, "j" => 24, "f" => 2, "r" => 6, "l" => 7 ],
    [ "i" => 50, "j" => 25, "f" => 2, "r" => 7, "l" => 7 ],
    [ "i" => 51, "j" => 25, "f" => 2, "r" => 7, "l" => 7 ],
    [ "i" => 52, "j" => 26, "f" => 2, "r" => 8, "l" => 7 ],
    [ "i" => 53, "j" => 26, "f" => 2, "r" => 8, "l" => 7 ],
    [ "i" => 54, "j" => 27, "f" => 3, "r" => 0, "l" => 7 ],
    [ "i" => 55, "j" => 27, "f" => 3, "r" => 0, "l" => 7 ],
    [ "i" => 56, "j" => 28, "f" => 3, "r" => 1, "l" => 7 ],
    [ "i" => 57, "j" => 28, "f" => 3, "r" => 1, "l" => 7 ],
    [ "i" => 58, "j" => 29, "f" => 3, "r" => 2, "l" => 7 ],
    [ "i" => 59, "j" => 29, "f" => 3, "r" => 2, "l" => 7 ],
    [ "i" => 60, "j" => 30, "f" => 3, "r" => 3, "l" => 7 ],
    [ "i" => 61, "j" => 30, "f" => 3, "r" => 3, "l" => 7 ],
    [ "i" => 62, "j" => 31, "f" => 3, "r" => 4, "l" => 7 ],
    [ "i" => 63, "j" => 31, "f" => 3, "r" => 4, "l" => 7 ],
    [ "i" => 64, "j" => 32, "f" => 3, "r" => 5, "l" => 7 ],
    [ "i" => 65, "j" => 32, "f" => 3, "r" => 5, "l" => 7 ],
    [ "i" => 66, "j" => 33, "f" => 3, "r" => 6, "l" => 7 ],
    [ "i" => 67, "j" => 33, "f" => 3, "r" => 6, "l" => 7 ],
    [ "i" => 68, "j" => 34, "f" => 3, "r" => 7, "l" => 7 ],
    [ "i" => 69, "j" => 34, "f" => 3, "r" => 7, "l" => 7 ],
    [ "i" => 70, "j" => 35, "f" => 3, "r" => 8, "l" => 7 ],
    [ "i" => 71, "j" => 35, "f" => 3, "r" => 8, "l" => 7 ],
    [ "i" => 72, "j" => 36, "f" => 4, "r" => 0, "l" => 7 ],
    [ "i" => 73, "j" => 36, "f" => 4, "r" => 0, "l" => 7 ],
    [ "i" => 74, "j" => 37, "f" => 4, "r" => 1, "l" => 7 ],
    [ "i" => 75, "j" => 37, "f" => 4, "r" => 1, "l" => 7 ],
    [ "i" => 76, "j" => 38, "f" => 4, "r" => 2, "l" => 7 ],
    [ "i" => 77, "j" => 38, "f" => 4, "r" => 2, "l" => 7 ],
    [ "i" => 78, "j" => 39, "f" => 4, "r" => 3, "l" => 7 ],
    [ "i" => 79, "j" => 39, "f" => 4, "r" => 3, "l" => 7 ],
    [ "i" => 80, "j" => 40, "f" => 4, "r" => 4, "l" => 7 ],
    [ "i" => 81, "j" => 40, "f" => 4, "r" => 4, "l" => 7 ],
    [ "i" => 82, "j" => 41, "f" => 4, "r" => 5, "l" => 7 ],
    [ "i" => 83, "j" => 41, "f" => 4, "r" => 5, "l" => 7 ],
    [ "i" => 84, "j" => 42, "f" => 4, "r" => 6, "l" => 7 ],
    [ "i" => 85, "j" => 42, "f" => 4, "r" => 6, "l" => 7 ],
    [ "i" => 86, "j" => 43, "f" => 4, "r" => 7, "l" => 7 ],
    [ "i" => 87, "j" => 43, "f" => 4, "r" => 7, "l" => 7 ],
    [ "i" => 88, "j" => 44, "f" => 4, "r" => 8, "l" => 7 ],
    [ "i" => 89, "j" => 44, "f" => 4, "r" => 8, "l" => 7 ],
    [ "i" => 90, "j" => 45, "f" => 5, "r" => 0, "l" => 7 ],
    [ "i" => 91, "j" => 45, "f" => 5, "r" => 0, "l" => 7 ],
    [ "i" => 92, "j" => 46, "f" => 5, "r" => 1, "l" => 7 ],
    [ "i" => 93, "j" => 46, "f" => 5, "r" => 1, "l" => 7 ],
    [ "i" => 94, "j" => 47, "f" => 5, "r" => 2, "l" => 7 ],
    [ "i" => 95, "j" => 47, "f" => 5, "r" => 2, "l" => 7 ],
    [ "i" => 96, "j" => 48, "f" => 5, "r" => 3, "l" => 7 ],
    [ "i" => 97, "j" => 48, "f" => 5, "r" => 3, "l" => 7 ],
    [ "i" => 98, "j" => 49, "f" => 5, "r" => 4, "l" => 7 ],
    [ "i" => 99, "j" => 49, "f" => 5, "r" => 4, "l" => 7 ],
    [ "i" => 100, "j" => 50, "f" => 5, "r" => 5, "l" => 7 ],
    [ "i" => 101, "j" => 50, "f" => 5, "r" => 5, "l" => 7 ],
    [ "i" => 102, "j" => 51, "f" => 5, "r" => 6, "l" => 7 ],
    [ "i" => 103, "j" => 51, "f" => 5, "r" => 6, "l" => 7 ],
    [ "i" => 104, "j" => 52, "f" => 5, "r" => 7, "l" => 7 ],
    [ "i" => 105, "j" => 52, "f" => 5, "r" => 7, "l" => 7 ],
    [ "i" => 106, "j" => 53, "f" => 5, "r" => 8, "l" => 7 ],
    [ "i" => 107, "j" => 53, "f" => 5, "r" => 8, "l" => 7 ],
    [ "i" => 108, "j" => 54, "f" => 6, "r" => 0, "l" => 7 ],
    [ "i" => 109, "j" => 54, "f" => 6, "r" => 0, "l" => 7 ],
    [ "i" => 110, "j" => 55, "f" => 6, "r" => 1, "l" => 7 ],
    [ "i" => 111, "j" => 55, "f" => 6, "r" => 1, "l" => 7 ],
    [ "i" => 112, "j" => 56, "f" => 6, "r" => 2, "l" => 7 ],
    [ "i" => 113, "j" => 56, "f" => 6, "r" => 2, "l" => 7 ],
    [ "i" => 114, "j" => 57, "f" => 6, "r" => 3, "l" => 7 ],
    [ "i" => 115, "j" => 57, "f" => 6, "r" => 3, "l" => 7 ],
    [ "i" => 116, "j" => 58, "f" => 6, "r" => 4, "l" => 7 ],
    [ "i" => 117, "j" => 58, "f" => 6, "r" => 4, "l" => 7 ],
    [ "i" => 118, "j" => 59, "f" => 6, "r" => 5, "l" => 7 ],
    [ "i" => 119, "j" => 59, "f" => 6, "r" => 5, "l" => 7 ],
    [ "i" => 120, "j" => 60, "f" => 6, "r" => 6, "l" => 7 ],
    [ "i" => 121, "j" => 60, "f" => 6, "r" => 6, "l" => 7 ],
    [ "i" => 122, "j" => 61, "f" => 6, "r" => 7, "l" => 7 ],
    [ "i" => 123, "j" => 61, "f" => 6, "r" => 7, "l" => 7 ],
    [ "i" => 124, "j" => 62, "f" => 6, "r" => 8, "l" => 7 ],
    [ "i" => 125, "j" => 62, "f" => 6, "r" => 8, "l" => 7 ],
    [ "i" => 126, "j" => 63, "f" => 7, "r" => 0, "l" => 7 ],
    [ "i" => 127, "j" => 63, "f" => 7, "r" => 0, "l" => 7 ],
    [ "i" => 128, "j" => 64, "f" => 7, "r" => 1, "l" => 7 ],
    [ "i" => 129, "j" => 64, "f" => 7, "r" => 1, "l" => 7 ],
    [ "i" => 130, "j" => 65, "f" => 7, "r" => 2, "l" => 7 ],
    [ "i" => 131, "j" => 65, "f" => 7, "r" => 2, "l" => 7 ],
    [ "i" => 132, "j" => 66, "f" => 7, "r" => 3, "l" => 7 ],
    [ "i" => 133, "j" => 66, "f" => 7, "r" => 3, "l" => 7 ],
    [ "i" => 134, "j" => 67, "f" => 7, "r" => 4, "l" => 7 ],
    [ "i" => 135, "j" => 67, "f" => 7, "r" => 4, "l" => 7 ],
    [ "i" => 136, "j" => 68, "f" => 7, "r" => 5, "l" => 7 ],
    [ "i" => 137, "j" => 68, "f" => 7, "r" => 5, "l" => 7 ],
    [ "i" => 138, "j" => 69, "f" => 7, "r" => 6, "l" => 7 ],
    [ "i" => 139, "j" => 69, "f" => 7, "r" => 6, "l" => 7 ],
    [ "i" => 140, "j" => 70, "f" => 7, "r" => 7, "l" => 7 ],
    [ "i" => 141, "j" => 70, "f" => 7, "r" => 7, "l" => 7 ],
    [ "i" => 142, "j" => 71, "f" => 7, "r" => 8, "l" => 7 ],
    [ "i" => 143, "j" => 71, "f" => 7, "r" => 8, "l" => 7 ],
    [ "i" => 144, "j" => 72, "f" => 8, "r" => 0, "l" => 7 ],
    [ "i" => 145, "j" => 72, "f" => 8, "r" => 0, "l" => 7 ],
    [ "i" => 146, "j" => 73, "f" => 8, "r" => 1, "l" => 7 ],
    [ "i" => 147, "j" => 73, "f" => 8, "r" => 1, "l" => 7 ],
    [ "i" => 148, "j" => 74, "f" => 8, "r" => 2, "l" => 7 ],
    [ "i" => 149, "j" => 74, "f" => 8, "r" => 2, "l" => 7 ],
    [ "i" => 150, "j" => 75, "f" => 8, "r" => 3, "l" => 7 ],
    [ "i" => 151, "j" => 75, "f" => 8, "r" => 3, "l" => 7 ],
    [ "i" => 152, "j" => 76, "f" => 8, "r" => 4, "l" => 7 ],
    [ "i" => 153, "j" => 76, "f" => 8, "r" => 4, "l" => 7 ],
    [ "i" => 154, "j" => 77, "f" => 8, "r" => 5, "l" => 7 ],
    [ "i" => 155, "j" => 77, "f" => 8, "r" => 5, "l" => 7 ],
    [ "i" => 156, "j" => 78, "f" => 8, "r" => 6, "l" => 7 ],
    [ "i" => 157, "j" => 78, "f" => 8, "r" => 6, "l" => 7 ],
    [ "i" => 158, "j" => 79, "f" => 8, "r" => 7, "l" => 7 ],
    [ "i" => 159, "j" => 79, "f" => 8, "r" => 7, "l" => 7 ],
    [ "i" => 160, "j" => 80, "f" => 8, "r" => 8, "l" => 7 ],
    [ "i" => 161, "j" => 80, "f" => 8, "r" => 8, "l" => 7 ],
    [ "i" => 162, "j" => 81, "f" => 9, "r" => 0, "l" => 7 ],
    [ "i" => 163, "j" => 81, "f" => 9, "r" => 0, "l" => 7 ],
    [ "i" => 164, "j" => 82, "f" => 9, "r" => 1, "l" => 7 ],
    [ "i" => 165, "j" => 82, "f" => 9, "r" => 1, "l" => 7 ],
    [ "i" => 166, "j" => 83, "f" => 9, "r" => 2, "l" => 7 ],
    [ "i" => 167, "j" => 83, "f" => 9, "r" => 2, "l" => 7 ],
    [ "i" => 168, "j" => 84, "f" => 9, "r" => 3, "l" => 7 ],
    [ "i" => 169, "j" => 84, "f" => 9, "r" => 3, "l" => 7 ],
    [ "i" => 170, "j" => 85, "f" => 9, "r" => 4, "l" => 7 ],
    [ "i" => 171, "j" => 85, "f" => 9, "r" => 4, "l" => 7 ],
    [ "i" => 172, "j" => 86, "f" => 9, "r" => 5, "l" => 7 ],
    [ "i" => 173, "j" => 86, "f" => 9, "r" => 5, "l" => 7 ],
    [ "i" => 174, "j" => 87, "f" => 9, "r" => 6, "l" => 7 ],
    [ "i" => 175, "j" => 87, "f" => 9, "r" => 6, "l" => 7 ],
    [ "i" => 176, "j" => 88, "f" => 9, "r" => 7, "l" => 7 ],
    [ "i" => 177, "j" => 88, "f" => 9, "r" => 7, "l" => 7 ],
    [ "i" => 178, "j" => 89, "f" => 9, "r" => 8, "l" => 7 ],
    [ "i" => 179, "j" => 89, "f" => 9, "r" => 8, "l" => 7 ],
    [ "i" => 180, "j" => 90, "f" => 10, "r" => 0, "l" => 7 ],
    [ "i" => 181, "j" => 90, "f" => 10, "r" => 0, "l" => 7 ],
    [ "i" => 182, "j" => 91, "f" => 10, "r" => 1, "l" => 7 ],
    [ "i" => 183, "j" => 91, "f" => 10, "r" => 1, "l" => 7 ],
    [ "i" => 184, "j" => 92, "f" => 10, "r" => 2, "l" => 7 ],
    [ "i" => 185, "j" => 92, "f" => 10, "r" => 2, "l" => 7 ],
    [ "i" => 186, "j" => 93, "f" => 10, "r" => 3, "l" => 7 ],
    [ "i" => 187, "j" => 93, "f" => 10, "r" => 3, "l" => 7 ],
    [ "i" => 188, "j" => 94, "f" => 10, "r" => 4, "l" => 7 ],
    [ "i" => 189, "j" => 94, "f" => 10, "r" => 4, "l" => 7 ],
    [ "i" => 190, "j" => 95, "f" => 10, "r" => 5, "l" => 7 ],
    [ "i" => 191, "j" => 95, "f" => 10, "r" => 5, "l" => 7 ],
    [ "i" => 192, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 193, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 194, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 195, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 196, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 197, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 198, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 199, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 200, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 201, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 202, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 203, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 204, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 205, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 206, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 207, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 208, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 209, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 210, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 211, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 212, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 213, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 214, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 215, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 216, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 217, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 218, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 219, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 220, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 221, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 222, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 223, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 224, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 225, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 226, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 227, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 228, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 229, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 230, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 231, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 232, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 233, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 234, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 235, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 236, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 237, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 238, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 239, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 240, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 241, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 242, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 243, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 244, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 245, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 246, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 247, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 248, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 249, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 250, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 251, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 252, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 253, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 254, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ],
    [ "i" => 255, "j" => -1, "f" => -1, "r" => -1, "l" => 6 ]
  ];
  private const tDeHufPiece = [
    [ "i" => 0, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 1, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 2, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 3, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 4, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 5, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 6, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 7, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 8, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 9, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 10, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 11, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 12, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 13, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 14, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 15, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 16, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 17, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 18, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 19, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 20, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 21, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 22, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 23, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 24, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 25, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 26, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 27, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 28, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 29, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 30, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 31, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 32, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 33, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 34, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 35, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 36, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 37, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 38, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 39, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 40, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 41, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 42, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 43, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 44, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 45, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 46, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 47, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 48, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 49, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 50, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 51, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 52, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 53, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 54, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 55, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 56, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 57, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 58, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 59, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 60, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 61, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 62, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 63, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 64, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 65, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 66, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 67, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 68, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 69, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 70, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 71, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 72, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 73, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 74, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 75, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 76, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 77, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 78, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 79, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 80, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 81, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 82, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 83, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 84, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 85, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 86, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 87, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 88, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 89, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 90, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 91, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 92, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 93, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 94, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 95, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 96, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 97, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 98, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 99, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 100, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 101, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 102, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 103, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 104, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 105, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 106, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 107, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 108, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 109, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 110, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 111, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 112, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 113, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 114, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 115, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 116, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 117, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 118, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 119, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 120, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 121, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 122, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 123, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 124, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 125, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 126, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 127, "c" => -1, "q" => "**", "u" => "**", "r" => -1, "p" => "***", "l" => 1 ],
    [ "i" => 128, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 129, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 130, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 131, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 132, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 133, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 134, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 135, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 136, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 137, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 138, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 139, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 140, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 141, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 142, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 143, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 4 ],
    [ "i" => 144, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 145, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 146, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 147, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 148, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 149, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 150, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 151, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 152, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 153, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 154, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 155, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 156, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 157, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 158, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 159, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 4 ],
    [ "i" => 160, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 161, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 162, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 163, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 164, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 165, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 166, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 167, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 168, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 169, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 170, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 171, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 172, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 173, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 174, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 175, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 4 ],
    [ "i" => 176, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 177, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 178, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 179, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 180, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 181, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 182, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 183, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 184, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 185, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 186, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 187, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 188, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 189, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 190, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 191, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 4 ],
    [ "i" => 192, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 6 ],
    [ "i" => 193, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 6 ],
    [ "i" => 194, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 6 ],
    [ "i" => 195, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 6 ],
    [ "i" => 196, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 6 ],
    [ "i" => 197, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 6 ],
    [ "i" => 198, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 6 ],
    [ "i" => 199, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 6 ],
    [ "i" => 200, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 6 ],
    [ "i" => 201, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 6 ],
    [ "i" => 202, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 6 ],
    [ "i" => 203, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 6 ],
    [ "i" => 204, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 6 ],
    [ "i" => 205, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 6 ],
    [ "i" => 206, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 6 ],
    [ "i" => 207, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 6 ],
    [ "i" => 208, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 6 ],
    [ "i" => 209, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 6 ],
    [ "i" => 210, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 6 ],
    [ "i" => 211, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 6 ],
    [ "i" => 212, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 6 ],
    [ "i" => 213, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 6 ],
    [ "i" => 214, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 6 ],
    [ "i" => 215, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 6 ],
    [ "i" => 216, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 6 ],
    [ "i" => 217, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 6 ],
    [ "i" => 218, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 6 ],
    [ "i" => 219, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 6 ],
    [ "i" => 220, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 6 ],
    [ "i" => 221, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 6 ],
    [ "i" => 222, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 6 ],
    [ "i" => 223, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 6 ],
    [ "i" => 224, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 6 ],
    [ "i" => 225, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 6 ],
    [ "i" => 226, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 6 ],
    [ "i" => 227, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 6 ],
    [ "i" => 228, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 6 ],
    [ "i" => 229, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 6 ],
    [ "i" => 230, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 6 ],
    [ "i" => 231, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 6 ],
    [ "i" => 232, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 6 ],
    [ "i" => 233, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 6 ],
    [ "i" => 234, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 6 ],
    [ "i" => 235, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 6 ],
    [ "i" => 236, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 6 ],
    [ "i" => 237, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 6 ],
    [ "i" => 238, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 6 ],
    [ "i" => 239, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 6 ],
    [ "i" => 240, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 6 ],
    [ "i" => 241, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 6 ],
    [ "i" => 242, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 6 ],
    [ "i" => 243, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 6 ],
    [ "i" => 244, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 6 ],
    [ "i" => 245, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 6 ],
    [ "i" => 246, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 6 ],
    [ "i" => 247, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 6 ],
    [ "i" => 248, "c" => 0, "q" => "KA", "u" => "KA", "r" => 0, "p" => "0KA", "l" => 8 ],
    [ "i" => 249, "c" => 1, "q" => "KA", "u" => "KA", "r" => 0, "p" => "1KA", "l" => 8 ],
    [ "i" => 250, "c" => 0, "q" => "UM", "u" => "KA", "r" => 1, "p" => "0UM", "l" => 8 ],
    [ "i" => 251, "c" => 1, "q" => "UM", "u" => "KA", "r" => 1, "p" => "1UM", "l" => 8 ],
    [ "i" => 252, "c" => 0, "q" => "HI", "u" => "HI", "r" => 0, "p" => "0HI", "l" => 8 ],
    [ "i" => 253, "c" => 1, "q" => "HI", "u" => "HI", "r" => 0, "p" => "1HI", "l" => 8 ],
    [ "i" => 254, "c" => 0, "q" => "RY", "u" => "HI", "r" => 1, "p" => "0RY", "l" => 8 ],
    [ "i" => 255, "c" => 1, "q" => "RY", "u" => "HI", "r" => 1, "p" => "1RY", "l" => 8 ]
  ];
  private const tDeHufHand = [
    [ "i" => 0, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 1, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 2, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 3, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 4, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 5, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 6, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 7, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 8, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 9, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 10, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 11, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 12, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 13, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 14, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 15, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 16, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 17, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 18, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 19, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 20, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 21, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 22, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 23, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 24, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 25, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 26, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 27, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 28, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 29, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 30, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 31, "c" => 0, "q" => "FU", "u" => "FU", "r" => 0, "p" => "0FU", "l" => 3 ],
    [ "i" => 32, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 33, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 34, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 35, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 36, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 37, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 38, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 39, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 40, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 41, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 42, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 43, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 44, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 45, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 46, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 47, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 48, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 49, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 50, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 51, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 52, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 53, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 54, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 55, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 56, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 57, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 58, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 59, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 60, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 61, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 62, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 63, "c" => 1, "q" => "FU", "u" => "FU", "r" => 0, "p" => "1FU", "l" => 3 ],
    [ "i" => 64, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 65, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 66, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 67, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 68, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 69, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 70, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 71, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 72, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 73, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 74, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 75, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 76, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 77, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 78, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 79, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 80, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 81, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 82, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 83, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 84, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 85, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 86, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 87, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 88, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 89, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 90, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 91, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 92, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 93, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 94, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 95, "c" => 0, "q" => "TO", "u" => "FU", "r" => 1, "p" => "0TO", "l" => 3 ],
    [ "i" => 96, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 97, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 98, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 99, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 100, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 101, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 102, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 103, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 104, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 105, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 106, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 107, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 108, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 109, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 110, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 111, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 112, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 113, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 114, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 115, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 116, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 117, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 118, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 119, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 120, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 121, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 122, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 123, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 124, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 125, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 126, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 127, "c" => 1, "q" => "TO", "u" => "FU", "r" => 1, "p" => "1TO", "l" => 3 ],
    [ "i" => 128, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 5 ],
    [ "i" => 129, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 5 ],
    [ "i" => 130, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 5 ],
    [ "i" => 131, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 5 ],
    [ "i" => 132, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 5 ],
    [ "i" => 133, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 5 ],
    [ "i" => 134, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 5 ],
    [ "i" => 135, "c" => 0, "q" => "KY", "u" => "KY", "r" => 0, "p" => "0KY", "l" => 5 ],
    [ "i" => 136, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 5 ],
    [ "i" => 137, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 5 ],
    [ "i" => 138, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 5 ],
    [ "i" => 139, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 5 ],
    [ "i" => 140, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 5 ],
    [ "i" => 141, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 5 ],
    [ "i" => 142, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 5 ],
    [ "i" => 143, "c" => 1, "q" => "KY", "u" => "KY", "r" => 0, "p" => "1KY", "l" => 5 ],
    [ "i" => 144, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 5 ],
    [ "i" => 145, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 5 ],
    [ "i" => 146, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 5 ],
    [ "i" => 147, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 5 ],
    [ "i" => 148, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 5 ],
    [ "i" => 149, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 5 ],
    [ "i" => 150, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 5 ],
    [ "i" => 151, "c" => 0, "q" => "NY", "u" => "KY", "r" => 1, "p" => "0NY", "l" => 5 ],
    [ "i" => 152, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 5 ],
    [ "i" => 153, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 5 ],
    [ "i" => 154, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 5 ],
    [ "i" => 155, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 5 ],
    [ "i" => 156, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 5 ],
    [ "i" => 157, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 5 ],
    [ "i" => 158, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 5 ],
    [ "i" => 159, "c" => 1, "q" => "NY", "u" => "KY", "r" => 1, "p" => "1NY", "l" => 5 ],
    [ "i" => 160, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 5 ],
    [ "i" => 161, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 5 ],
    [ "i" => 162, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 5 ],
    [ "i" => 163, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 5 ],
    [ "i" => 164, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 5 ],
    [ "i" => 165, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 5 ],
    [ "i" => 166, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 5 ],
    [ "i" => 167, "c" => 0, "q" => "KE", "u" => "KE", "r" => 0, "p" => "0KE", "l" => 5 ],
    [ "i" => 168, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 5 ],
    [ "i" => 169, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 5 ],
    [ "i" => 170, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 5 ],
    [ "i" => 171, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 5 ],
    [ "i" => 172, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 5 ],
    [ "i" => 173, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 5 ],
    [ "i" => 174, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 5 ],
    [ "i" => 175, "c" => 1, "q" => "KE", "u" => "KE", "r" => 0, "p" => "1KE", "l" => 5 ],
    [ "i" => 176, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 5 ],
    [ "i" => 177, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 5 ],
    [ "i" => 178, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 5 ],
    [ "i" => 179, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 5 ],
    [ "i" => 180, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 5 ],
    [ "i" => 181, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 5 ],
    [ "i" => 182, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 5 ],
    [ "i" => 183, "c" => 0, "q" => "NK", "u" => "KE", "r" => 1, "p" => "0NK", "l" => 5 ],
    [ "i" => 184, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 5 ],
    [ "i" => 185, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 5 ],
    [ "i" => 186, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 5 ],
    [ "i" => 187, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 5 ],
    [ "i" => 188, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 5 ],
    [ "i" => 189, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 5 ],
    [ "i" => 190, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 5 ],
    [ "i" => 191, "c" => 1, "q" => "NK", "u" => "KE", "r" => 1, "p" => "1NK", "l" => 5 ],
    [ "i" => 192, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 5 ],
    [ "i" => 193, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 5 ],
    [ "i" => 194, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 5 ],
    [ "i" => 195, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 5 ],
    [ "i" => 196, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 5 ],
    [ "i" => 197, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 5 ],
    [ "i" => 198, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 5 ],
    [ "i" => 199, "c" => 0, "q" => "GI", "u" => "GI", "r" => 0, "p" => "0GI", "l" => 5 ],
    [ "i" => 200, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 5 ],
    [ "i" => 201, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 5 ],
    [ "i" => 202, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 5 ],
    [ "i" => 203, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 5 ],
    [ "i" => 204, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 5 ],
    [ "i" => 205, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 5 ],
    [ "i" => 206, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 5 ],
    [ "i" => 207, "c" => 1, "q" => "GI", "u" => "GI", "r" => 0, "p" => "1GI", "l" => 5 ],
    [ "i" => 208, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 5 ],
    [ "i" => 209, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 5 ],
    [ "i" => 210, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 5 ],
    [ "i" => 211, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 5 ],
    [ "i" => 212, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 5 ],
    [ "i" => 213, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 5 ],
    [ "i" => 214, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 5 ],
    [ "i" => 215, "c" => 0, "q" => "NG", "u" => "GI", "r" => 1, "p" => "0NG", "l" => 5 ],
    [ "i" => 216, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 5 ],
    [ "i" => 217, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 5 ],
    [ "i" => 218, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 5 ],
    [ "i" => 219, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 5 ],
    [ "i" => 220, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 5 ],
    [ "i" => 221, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 5 ],
    [ "i" => 222, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 5 ],
    [ "i" => 223, "c" => 1, "q" => "NG", "u" => "GI", "r" => 1, "p" => "1NG", "l" => 5 ],
    [ "i" => 224, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 5 ],
    [ "i" => 225, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 5 ],
    [ "i" => 226, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 5 ],
    [ "i" => 227, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 5 ],
    [ "i" => 228, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 5 ],
    [ "i" => 229, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 5 ],
    [ "i" => 230, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 5 ],
    [ "i" => 231, "c" => 0, "q" => "KI", "u" => "KI", "r" => 0, "p" => "0KI", "l" => 5 ],
    [ "i" => 232, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 5 ],
    [ "i" => 233, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 5 ],
    [ "i" => 234, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 5 ],
    [ "i" => 235, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 5 ],
    [ "i" => 236, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 5 ],
    [ "i" => 237, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 5 ],
    [ "i" => 238, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 5 ],
    [ "i" => 239, "c" => 1, "q" => "KI", "u" => "KI", "r" => 0, "p" => "1KI", "l" => 5 ],
    [ "i" => 240, "c" => 0, "q" => "KA", "u" => "KA", "r" => 0, "p" => "0KA", "l" => 7 ],
    [ "i" => 241, "c" => 0, "q" => "KA", "u" => "KA", "r" => 0, "p" => "0KA", "l" => 7 ],
    [ "i" => 242, "c" => 1, "q" => "KA", "u" => "KA", "r" => 0, "p" => "1KA", "l" => 7 ],
    [ "i" => 243, "c" => 1, "q" => "KA", "u" => "KA", "r" => 0, "p" => "1KA", "l" => 7 ],
    [ "i" => 244, "c" => 0, "q" => "UM", "u" => "KA", "r" => 1, "p" => "0UM", "l" => 7 ],
    [ "i" => 245, "c" => 0, "q" => "UM", "u" => "KA", "r" => 1, "p" => "0UM", "l" => 7 ],
    [ "i" => 246, "c" => 1, "q" => "UM", "u" => "KA", "r" => 1, "p" => "1UM", "l" => 7 ],
    [ "i" => 247, "c" => 1, "q" => "UM", "u" => "KA", "r" => 1, "p" => "1UM", "l" => 7 ],
    [ "i" => 248, "c" => 0, "q" => "HI", "u" => "HI", "r" => 0, "p" => "0HI", "l" => 7 ],
    [ "i" => 249, "c" => 0, "q" => "HI", "u" => "HI", "r" => 0, "p" => "0HI", "l" => 7 ],
    [ "i" => 250, "c" => 1, "q" => "HI", "u" => "HI", "r" => 0, "p" => "1HI", "l" => 7 ],
    [ "i" => 251, "c" => 1, "q" => "HI", "u" => "HI", "r" => 0, "p" => "1HI", "l" => 7 ],
    [ "i" => 252, "c" => 0, "q" => "RY", "u" => "HI", "r" => 1, "p" => "0RY", "l" => 7 ],
    [ "i" => 253, "c" => 0, "q" => "RY", "u" => "HI", "r" => 1, "p" => "0RY", "l" => 7 ],
    [ "i" => 254, "c" => 1, "q" => "RY", "u" => "HI", "r" => 1, "p" => "1RY", "l" => 7 ],
    [ "i" => 255, "c" => 1, "q" => "RY", "u" => "HI", "r" => 1, "p" => "1RY", "l" => 7 ]
  ];
  private const tCsa2SfenKind = [
    [
      "OU" => "K",
      "FU" => "P",
      "KY" => "L",
      "KE" => "N",
      "GI" => "S",
      "KI" => "G",
      "KA" => "B",
      "HI" => "R",
      "TO" => "+P",
      "NY" => "+L",
      "NK" => "+N",
      "NG" => "+S",
      "UM" => "+B",
      "RY" => "+R",
    ],
    [
      "OU" => "k",
      "FU" => "p",
      "KY" => "l",
      "KE" => "n",
      "GI" => "s",
      "KI" => "g",
      "KA" => "b",
      "HI" => "r",
      "TO" => "+p",
      "NY" => "+l",
      "NK" => "+n",
      "NG" => "+s",
      "UM" => "+b",
      "RY" => "+r",
    ],
  ];
  private const tCsaKind = [
    NULL,"FU","KY","KE","GI","KI","KA","HI",
    "OU","TO","NY","NK","NG",NULL,"UM","RY",
  ];
  private const tCsaUnpromoteKind = [
    "OU" => "OU",
    "FU" => "FU",
    "KY" => "KY",
    "KE" => "KE",
    "GI" => "GI",
    "KI" => "KI",
    "KA" => "KA",
    "HI" => "HI",
    "TO" => "FU",
    "NY" => "KY",
    "NK" => "KE",
    "NG" => "GI",
    "UM" => "KA",
    "RY" => "HI",
  ];
  private const tMoveRel = [
    NULL,"L","C","R",
    "M","LM","H","RM",
    "U","LU","CU","RU",
    "D","LD","CD","RD",
  ];
  private const tMoveCap = [
    NULL,"FU","KY","KE","GI","KI","KA","HI",
    "OU","TO","NY","NK","NG",NULL,"UM","RY",
  ];
  private const tFileToKan = ["１","２","３","４","５","６","７","８","９"];
  private const tRankToKan = ["一","二","三","四","五","六","七","八","九"];
  private const tKindToKan = [
    "OU"=>"玉","FU"=>"歩","KY"=>"香","KE"=>"桂",
    "GI"=>"銀","KI"=>"金","KA"=>"角","HI"=>"飛",
    "TO"=>"と","NY"=>"成香","NK"=>"成桂",
    "NG"=>"成銀","UM"=>"馬","RY"=>"龍",
  ];
  private const tRelToKan = [
    "L"=>"左","C"=>"直","R"=>"右",
    "M"=>"寄","LM"=>"左寄","H"=>"打","RM"=>"右寄",
    "U"=>"上","LU"=>"左上","CU"=>"直上","RU"=>"右上",
    "D"=>"引","LD"=>"左引","CD"=>"直引","RD"=>"右引",
  ];
}

?>
